STMicroelectronics/trusted-firmware-m/platform/ext/target/stm/common/stm32mp2/secure/tfm_hal_isolation.c
/*
 * Copyright (C) 2020, STMicroelectronics
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */
#include <cmsis.h>
#include <lib/utils_def.h>
#include <region.h>
#include <target_cfg.h>
#include <device_cfg.h>
#include <tfm_hal_isolation.h>
#include <tfm_core_utils.h>
#include <load/spm_load_api.h>

#include <mpu_armv8m_drv.h>
#include <stm32_icache.h>

/* It can be retrieved from the MPU_TYPE register. */
#define MPU_REGION_NUM                  8
#ifdef CONFIG_TFM_ENABLE_MEMORY_PROTECT
static uint32_t n_configured_regions = 0;

REGION_DECLARE(Load$$LR$$, LR_VENEER, $$Base);
REGION_DECLARE(Load$$LR$$, LR_VENEER, $$Limit);
REGION_DECLARE(Image$$, TFM_UNPRIV_CODE, $$RO$$Base);
REGION_DECLARE(Image$$, TFM_UNPRIV_CODE, $$RO$$Limit);
REGION_DECLARE(Image$$, TFM_APP_CODE_START, $$Base);
REGION_DECLARE(Image$$, TFM_APP_CODE_END, $$Base);
REGION_DECLARE(Image$$, TFM_APP_RW_STACK_START, $$Base);
REGION_DECLARE(Image$$, TFM_APP_RW_STACK_END, $$Base);
#ifdef TFM_SP_META_PTR_ENABLE
REGION_DECLARE(Image$$, TFM_SP_META_PTR, $$RW$$Base);
REGION_DECLARE(Image$$, TFM_SP_META_PTR, $$RW$$Limit);
#endif
#endif /* CONFIG_TFM_ENABLE_MEMORY_PROTECT */

static const struct mpu_armv8m_region_cfg_t __maybe_unused mpu_regions[] = {
	/* Veneer region */
	{
		0, /* will be updated before using */
		(uint32_t)&REGION_NAME(Load$$LR$$, LR_VENEER, $$Base),
		(uint32_t)&REGION_NAME(Load$$LR$$, LR_VENEER, $$Limit),
		MPU_ARMV8M_MAIR_ATTR_CODE_IDX,
		MPU_ARMV8M_XN_EXEC_OK,
		MPU_ARMV8M_AP_RO_PRIV_UNPRIV,
		MPU_ARMV8M_SH_NONE
	},
	/* TFM Core unprivileged code region */
	{
		0, /* will be updated before using */
		(uint32_t)&REGION_NAME(Image$$, TFM_UNPRIV_CODE, $$RO$$Base),
		(uint32_t)&REGION_NAME(Image$$, TFM_UNPRIV_CODE, $$RO$$Limit),
		MPU_ARMV8M_MAIR_ATTR_CODE_IDX,
		MPU_ARMV8M_XN_EXEC_OK,
		MPU_ARMV8M_AP_RO_PRIV_UNPRIV,
		MPU_ARMV8M_SH_NONE
	},
	/* RO region */
	{
		0, /* will be updated before using */
		(uint32_t)&REGION_NAME(Image$$, TFM_APP_CODE_START, $$Base),
		(uint32_t)&REGION_NAME(Image$$, TFM_APP_CODE_END, $$Base),
		MPU_ARMV8M_MAIR_ATTR_CODE_IDX,
		MPU_ARMV8M_XN_EXEC_OK,
		MPU_ARMV8M_AP_RO_PRIV_UNPRIV,
		MPU_ARMV8M_SH_NONE
	},
	/* RW, ZI and stack as one region */
	{
		0, /* will be updated before using */
		(uint32_t)&REGION_NAME(Image$$, TFM_APP_RW_STACK_START, $$Base),
		(uint32_t)&REGION_NAME(Image$$, TFM_APP_RW_STACK_END, $$Base),
		MPU_ARMV8M_MAIR_ATTR_DATA_IDX,
		MPU_ARMV8M_XN_EXEC_NEVER,
		MPU_ARMV8M_AP_RW_PRIV_UNPRIV,
		MPU_ARMV8M_SH_NONE
	},
#ifdef TFM_SP_META_PTR_ENABLE
	/* TFM partition metadata pointer region */
	{
		0, /* will be updated before using */
		(uint32_t)&REGION_NAME(Image$$, TFM_SP_META_PTR, $$RW$$Base),
		(uint32_t)&REGION_NAME(Image$$, TFM_SP_META_PTR, $$ZI$$Limit),
		MPU_ARMV8M_MAIR_ATTR_DATA_IDX,
		MPU_ARMV8M_XN_EXEC_NEVER,
		MPU_ARMV8M_AP_RW_PRIV_UNPRIV,
		MPU_ARMV8M_SH_NONE
	},
#endif
#if defined(STM32_PS_OSPI)
	/*
	 * used by ospi and fmc
	 * for memory mapping to generate external memory command
	 */
	{
		0, /* will be updated before using */
		QSPI_MEM_BASE,
		DRAM_MEM_BASE - 1,
		MPU_ARMV8M_MAIR_ATTR_DEVICE_IDX,
		MPU_ARMV8M_XN_EXEC_NEVER,
		MPU_ARMV8M_AP_RW_PRIV_UNPRIV,
		MPU_ARMV8M_SH_NONE
	},
#endif
};

enum tfm_hal_status_t __maybe_unused tfm_hal_mpu_init(void)
{
	struct mpu_armv8m_dev_t dev_mpu_s = { MPU_BASE };
	struct mpu_armv8m_region_cfg_t *rg, localcfg;
	int32_t i;

	mpu_armv8m_clean(&dev_mpu_s);

	for_each_mpu_region(mpu_regions, rg, ARRAY_SIZE(mpu_regions), i) {
		spm_memcpy(&localcfg, rg, sizeof(localcfg));
		localcfg.region_nr = i;

		if (mpu_armv8m_region_enable(&dev_mpu_s, &localcfg) != MPU_ARMV8M_OK)
			return TFM_HAL_ERROR_GENERIC;
	}

	n_configured_regions = i;

	mpu_armv8m_enable(&dev_mpu_s, PRIVILEGED_DEFAULT_ENABLE,
			  HARDFAULT_NMI_ENABLE);

	return 0;
}

enum tfm_hal_status_t tfm_hal_set_up_static_boundaries(void)
{
	/* Set up isolation boundaries between SPE and NSPE */
	sau_and_idau_cfg();

	/* Set up static isolation boundaries inside SPE */
#ifdef CONFIG_TFM_ENABLE_MEMORY_PROTECT
	if (tfm_hal_mpu_init())
		return TFM_HAL_ERROR_GENERIC;
#endif

	return TFM_HAL_SUCCESS;
}

/*
 * Implementation of tfm_hal_bind_boundaries() on STM:
 *
 * The API encodes some attributes into a handle and returns it to SPM.
 * The attributes include isolation boundaries, privilege, and MMIO information.
 * When scheduler switches running partitions, SPM compares the handle between
 * partitions to know if boundary update is necessary. If update is required,
 * SPM passes the handle to platform to do platform settings and update
 * isolation boundaries.
 *
 * The handle should be unique under isolation level 3. The implementation
 * encodes an index at the highest 8 bits to assure handle uniqueness. While
 * under isolation level 1/2, handles may not be unique.
 *
 * The encoding format assignment:
 * - For isolation level 3
 *      BIT | 31        24 | 23         20 | ... | 7           4 | 3        0 |
 *          | Unique Index | Region Attr 5 | ... | Region Attr 1 | Privileged |
 *
 *      In which the "Region Attr i" is:
 *      BIT |       3      | 2        0 |
 *          | 1: RW, 0: RO | MMIO Index |
 *
 * - For isolation level 1/2
 *      BIT | 31                           0 |
 *          | 1: privileged, 0: unprivileged |
 *
 * This is a reference implementation on STM, and may have some limitations.
 * 1. The maximum number of allowed MMIO regions is 5.
 * 2. Highest 8 bits are for index. It supports 256 unique handles at most.
 */

enum tfm_hal_status_t tfm_hal_bind_boundaries(
					      const struct partition_load_info_t *p_ldinf,
					      void **pp_boundaries)
{
	return TFM_HAL_SUCCESS;
}

enum tfm_hal_status_t tfm_hal_update_boundaries(
						const struct partition_load_info_t *p_ldinf,
						void *p_boundaries)
{
	return TFM_HAL_SUCCESS;
}
